app/workers/bulk_upload_subjects.rb

INSERT INTO "subjects" ("name", "description", "created_at", "updated_at", "category") VALUES (?, ?, ?, ?, ?)  [["name", "Mist King"], ["description", "Automated misting system"], ["created_at", "2022-08-21 14:19:48.589826"], ["updated_at", "2022-08-21 14:19:48.589826"], ["category", "equipment"]]
---
  def perform
    subjects_text = File.read(Rails.root.join('lib', 'seeds_csvs', 'subjects.csv'))
    subjects_csv = CSV.parse(subjects_text, headers: true, encoding: 'ISO-8859-1')
    subjects = subjects_csv.map {|row| row.to_h }

    subjects.each do |subject|
      Subject.create(
        name: subject['name'],
        description: subject['description'],
        formal_name: subject['formal_name'],
        notes: subject['notes'],
        category: subject['category']
      )