app/controllers/animals_controller.rb

  def set_animals
    @animals =Subject.where.not(formal_name: nil).paginate(page: params[:page], per_page: 10)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."formal_name" IS NOT NULL LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects" WHERE "subjects"."formal_name" IS NOT NULL